rottenpotatoes/app/controllers/movies_controller.rb

  def index

    sort = params[:sort] || session[:sort]
    case sort
      when 'title'
        ordering,@title_header = :title, 'hilite'
      when 'release_date'
        ordering,@date_header = :release_date, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')  ORDER BY order.o ASC